# Python 基础学习
# 蛋挞不能吃
# 学习时间： 2021/12/13 0013 20:01

# 切片方法适用于字符串、列表、元组这样的有序集合
# 字符串[开始索引:结束索引:步长] 步长取负可以实现逆序
num_str = "0123456789"

# * 1. 截取从 2 ~ 5 位置 的字符串
print(num_str[2:6])

# * 2. 截取从 2 ~ `末尾` 的字符串
print(num_str[2:])

# * 3. 截取从 `开始` ~ 5 位置 的字符串
print(num_str[:6])

# * 4. 截取完整的字符串
print(num_str[:])

# * 5. 从开始位置，每隔一个字符截取字符串
print(num_str[::2])

# * 6. 从索引 1 开始，每隔一个取一个
print(num_str[1::2])

# * 7. 截取从 2 ~ `末尾 - 1` 的字符串
print(num_str[2:-1])

# * 8. 截取字符串末尾两个字符
print(num_str[-2:])

# * 9. 字符串的逆序（面试题）
print(num_str[::-1])
